#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
infra relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/AwsLambdaDotnetWebApi/AwsLambdaDotnetWebApi/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/AwsLambdaDotnetWebApi/AwsLambdaDotnetWebApi

To view this run in a browser, visit:
https://app.terraform.io/app/personal-burrt/template-github-actions/runs/run-uPmibw4ctwpoz8tL

Waiting for the plan to start...

Terraform v1.10.5
on linux_amd64
Initializing plugins and modules...
data.terraform_remote_state.network: Refreshing...
data.terraform_remote_state.network: Refresh complete after 1s
aws_iam_policy.lambda-dotnet-web-api-policy: Refreshing state... [id=arn:aws:iam::398018169858:policy/lambda-dotnet-web-api-policy]
aws_iam_role.lambda-dotnet-web-api-role: Refreshing state... [id=lambda-dotnet-web-api-role]
aws_iam_role_policy_attachment.lambda-dotnet-web-api-role-policy: Refreshing state... [id=lambda-dotnet-web-api-role-20250206154726191000000002]
aws_lambda_function.aws_lambda_dotnet_web_api: Refreshing state... [id=AwsLambdaDotnetWebApi]
aws_lambda_permission.api-gateway-lambda-invoke-perm: Refreshing state... [id=AllowApiGatewayInvoke]
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named
│ "TF_VAR_lambda_dotnet_redis_user_password" but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-uPmibw4ctwpoz8tL/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_function.aws_lambda_dotnet_web_api will be updated in-place
  ~ resource "aws_lambda_function" "aws_lambda_dotnet_web_api" {
        id                             = "AwsLambdaDotnetWebApi"
      ~ last_modified                  = "2025-02-06T16:02:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "zrXtkm8B6R5umTUFNBmHQnLJBMDookCcB+/9/8+QMbg=" -> "ZVBxUrhfuh9eqC4qVpJ3Nmee1s+t38bNSG339/qXjDE="
        tags                           = {
            "GIT_COMMIT" = "TODO"
        }
        # (27 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_secretsmanager_secret.sm-redis-user-secret will be created
  + resource "aws_secretsmanager_secret" "sm-redis-user-secret" {
      + arn                            = (known after apply)
      + description                    = "Redis user secret for the .NET Web API Lambda"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "templates/AwsLambdaDotnetWebApi/redis-user-secret"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # aws_secretsmanager_secret_version.sm-redis-user-secret will be created
  + resource "aws_secretsmanager_secret_version" "sm-redis-user-secret" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @burrt, Action: `pull_request`, Working Directory: ``, Workflow: `CI/CD`*